# COMP40370 Pratical 2 (Part A) Datawarehouse

***

### Imports

In [11]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
import psycopg2

***

## Question 1: Data Cube

***

### Creating Dataframe from Dataset

In [50]:
df = pd.read_csv('DW_dataset.csv') #Load Dataset
df

,Employee ID,Name,Date of Birth,Gender,Job Title,Salary,Date Joined,Date Left,Address
0,100,Smith,12-Jan-74,M,Director,50000,01-Aug-01,NaN,"12, Green Avenue, Howth, Co. Dublin"
1,125,Jones,06-Apr-89,F,Technician,40000,01-May-01,31-Aug-02,"43, School Road, Malahide, Co. Dublin"
2,167,Davis,19-Jan-82,F,Senior Technician,50000,01-Dec-02,NaN,"10, Main Street, Naas, Co. Kildare"
3,200,O'Bien,03-May-97,M,Technician,25000,01-May-02,30-Nov-02,"Apt 02, High Court, Condalkin. Co. Dublin"
4,205,Edward,16-Nov-95,M,Technician,33000,01-Jan-01,NaN,"33, Barake Street, Clane, Co. Kildare"
5,216,Evans,22-Mar-95,F,S' Technician,44000,01-Aug-01,31-Mar-02,"143, High Street, Niwbridge, Co. Kildare"
6,220,Moore,28-Jun-96,F,Jnr. Technician,33000,01-Jan-02,NaN,"Apt 01, Shreedon Court, Rathcoole, Co. Dublin"
7,301,Rogers,14-Nov-75,M,Deputy Director,60000,01-May-02,NaN,"Manor House, Naas Road, Inchico, Co. Dublin"
8,303,Phillip,14-Oct-76,F,HR Manager,75000,01-Jan-02,NaN,"44, Dublin Road, Finglas, Co. Dublin"
9,344,Shane,06-Jul-86,M,"D"" Director",50000,01-Jan-01,30-Apr-02,"65, Waterway, Killiney, Co. Dublin"
10,351,Alan,22-May-73,M,Dep. Director,80000,01-Apr-01,NaN,"43, Shandon Court, Clane, Co. Kildare"
11,364,Gary,11-Nov-81,M,Eng` Manager,85000,01-Jan-01,31-Mar-22,"22, Earls, Newbridge, Co. Kildare"
12,371,Robert,27-Jan-93,M,J Technician,27000,01-Jan-01,31-Oct-21,"61, Robert Street, Dublin 04, Co. Dublin"
13,380,Jason,28-Feb-81,M,Lead Technician,45000,02-Feb-01,NaN,"56, Alex Street, Dublin 01, Co. Dublin"
14,393,Marry,18-May-76,F,Director,70000,01-Jan-01,30-Nov-22,"59, Sea Forth, Sword, Co. Dublin"
15,409,Hilary,15-Jun-88,F,Marketing Director,78000,01-Mar-01,NaN,"87, Bray Street, Kildare, Co. Kildare"

### Applying Provided Pre-Processing to Dataframe

In [51]:
# Apply provided Pre-Processing to dataframe
df['Date of Birth'] = pd.to_datetime(df['Date of Birth'],
infer_datetime_format=True)
df['Date Joined'] = pd.to_datetime(df['Date Joined'],
infer_datetime_format=True)
df['Date Left'] = pd.to_datetime(df['Date Left'], infer_datetime_format=True)
def getJobCategory(x):
    y = x.split(' ');
    if 'Technician' in y:
        return 'Technical'
    elif 'Director' in y:
        return 'Management'
    elif 'Manager' in y:
        return 'Management'
df['Job Category'] = df["Job Title"].apply(getJobCategory)
df.head()
df = df.drop(['Address', 'Job Title'], axis=1)
df

/tmp/ipykernel_5729/3442699941.py:2: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df['Date of Birth'] = pd.to_datetime(df['Date of Birth'],
/tmp/ipykernel_5729/3442699941.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Date of Birth'] = pd.to_datetime(df['Date of Birth'],
/tmp/ipykernel_5729/3442699941.py:4: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df['Date Joined'] = pd.to_datetime(df['Date Joined'],
/tmp/ipykernel_5729/3442699941.py:4: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Date Joined'] = pd.to_datetime(df['Date Joined'],
/tmp/ipykernel_5729/3442699941.py:6: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df['Date Left'] = pd.to_datetime(df['Date Left'], infer_datetime_format=True)
/tmp/ipykernel_5729/3442699941.py:6: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Date Left'] = pd.to_datetime(df['Date Left'], infer_datetime_format=True)

,Employee ID,Name,Date of Birth,Gender,Salary,Date Joined,Date Left,Job Category
0,100,Smith,1974-01-12,M,50000,2001-08-01,NaT,Management
1,125,Jones,1989-04-06,F,40000,2001-05-01,2002-08-31,Technical
2,167,Davis,1982-01-19,F,50000,2002-12-01,NaT,Technical
3,200,O'Bien,1997-05-03,M,25000,2002-05-01,2002-11-30,Technical
4,205,Edward,1995-11-16,M,33000,2001-01-01,NaT,Technical
5,216,Evans,1995-03-22,F,44000,2001-08-01,2002-03-31,Technical
6,220,Moore,1996-06-28,F,33000,2002-01-01,NaT,Technical
7,301,Rogers,1975-11-14,M,60000,2002-05-01,NaT,Management
8,303,Phillip,1976-10-14,F,75000,2002-01-01,NaT,Management
9,344,Shane,1986-07-06,M,50000,2001-01-01,2002-04-30,Management
10,351,Alan,1973-05-22,M,80000,2001-04-01,NaT,Management
11,364,Gary,1981-11-11,M,85000,2001-01-01,2022-03-31,Management
12,371,Robert,1993-01-27,M,27000,2001-01-01,2021-10-31,Technical
13,380,Jason,1981-02-28,M,45000,2001-02-02,NaT,Technical
14,393,Marry,1976-05-18,F,70000,2001-01-01,2022-11-30,Management
15,409,Hilary,1988-06-15,F,78000,2001-03-01,NaT,Management

### Creating PostgreSQL Database

### Creating Alchemy Engine and Connecting to Database

In [74]:
#Defining Database Details
PGusername = 'dandex'
PGpass = 'ucdschool'
DBname = 'datam_p2'

#Creating Engine
engine = create_engine(f'postgresql://{PGusername}:{PGpass}@localhost/{DBname}')

#Testing Connection
try: 
    with engine.connect() as connection:
        result = connection.execute(text("SELECT 1")) #Executing a command to ensure it's working
        print(result.scalar()) 
        print("Connected successfully")
except:
    print("Connection error")

#Closing Connection
engine.dispose()

1
Connected successfully

In [77]:
df

,Employee ID,Name,Date of Birth,Gender,Salary,Date Joined,Date Left,Job Category
0,100,Smith,1974-01-12,M,50000,2001-08-01,NaT,Management
1,125,Jones,1989-04-06,F,40000,2001-05-01,2002-08-31,Technical
2,167,Davis,1982-01-19,F,50000,2002-12-01,NaT,Technical
3,200,O'Bien,1997-05-03,M,25000,2002-05-01,2002-11-30,Technical
4,205,Edward,1995-11-16,M,33000,2001-01-01,NaT,Technical
5,216,Evans,1995-03-22,F,44000,2001-08-01,2002-03-31,Technical
6,220,Moore,1996-06-28,F,33000,2002-01-01,NaT,Technical
7,301,Rogers,1975-11-14,M,60000,2002-05-01,NaT,Management
8,303,Phillip,1976-10-14,F,75000,2002-01-01,NaT,Management
9,344,Shane,1986-07-06,M,50000,2001-01-01,2002-04-30,Management
10,351,Alan,1973-05-22,M,80000,2001-04-01,NaT,Management
11,364,Gary,1981-11-11,M,85000,2001-01-01,2022-03-31,Management
12,371,Robert,1993-01-27,M,27000,2001-01-01,2021-10-31,Technical
13,380,Jason,1981-02-28,M,45000,2001-02-02,NaT,Technical
14,393,Marry,1976-05-18,F,70000,2001-01-01,2022-11-30,Management
15,409,Hilary,1988-06-15,F,78000,2001-03-01,NaT,Management

### Store Dataframe To Database

In [76]:
table_name = 'dwdata'
df.to_sql(table_name, con=engine, if_exists="replace", index=False)

ProgrammingError: (psycopg2.errors.InsufficientPrivilege) permission denied for schema public
LINE 2: CREATE TABLE dwdata (
                     ^

[SQL:
CREATE TABLE dwdata (
	"Employee ID" BIGINT,
	"Name" TEXT,
	"Date of Birth" TIMESTAMP WITHOUT TIME ZONE,
	"Gender" TEXT,
	"Salary" BIGINT,
	"Date Joined" TIMESTAMP WITHOUT TIME ZONE,
	"Date Left" TIMESTAMP WITHOUT TIME ZONE,
	"Job Category" TEXT
)

]
(Background on this error at: https://sqlalche.me/e/20/f405)

### PostgreSQL OLAP Queries

#### 1) Calculate the average salary of management staff for males and females separately.

#### 2) Calculate the average salaries of employees between the counties of Kildare and Dublin. Then calculate the average salary by gender and by county

#### 3) How many people are employed at the end of 2022 who were born in the 1970s, 1980s and 1990s respectively?

#### 4) If the employee retention rate is the % of staff who stayed during a period (compared to the beginning of that period), what are the employee retention rates in 2001 and 2002?

#### 5) Show the retention rates based on the quarter of the years 2001 and 2002.

***

## Question 2: Data Warehouse - Implementation

***

***